print("Михайленко Ярослава Євгенівна \nЛабораторна робота №1 \nВаріант 10 \nЗнаходження дільника \n")


def myfunc():
    a = float(input("Введіть число а:"))
    b = float(input("Введіть число b:"))
    c = float(input("Введіть число c:"))
    k = float(input("Введіть число k:"))
    i = 0
    if (a%k)==0:
        print("Число k є дільником числа a")
        p = input("Продолжить тестирование программы? +/-")
        if p == "+":
            myfunc()
        else:
            return
        i += 1
    if (b%k)==0:
        print("Число k є дільником числа b")
        p = input("Продолжить тестирование программы? +/-")
        if p == "+":
            myfunc()
        else:
            return
        i += 1
    if (c%k)==0:
        print("Число k є дільником числа c")
        p = input("Продолжить тестирование программы? +/-")
        if p == "+":
            myfunc()
        else:
            return
        i += 1
    if i == 0:
        print("Число k не є дільником жодного з чисел")
        p = input("Продолжить тестирование программы? +/-")
        if p == "+":
            myfunc()
        else:
            return
myfunc()
